//RFD9A2      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL ??? FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//A2R        EXEC PGM=A2STOCK
//STEPLIB      DD DSN=KC03FD9.INFT2200.COBOL.LOADLIB,
//    DISP=SHR
//INFILE       DD DSN=KC03FD9.INFT2200.A2.STOCK.DAT,
//    DISP=SHR
//OUTFILE      DD DSN=KC03FD9.INFT2200.A2.STOCK.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=132
/*