//RFD9A1      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL ??? FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//A1R        EXEC PGM=A1PLIST
//STEPLIB      DD DSN=KC03FD9.INFT2200.COBOL.LOADLIB,
//    DISP=SHR
//INFILE       DD DSN=KC03FD9.INFT2200.A1.PLIST.DAT,
//    DISP=SHR
//OUTFILE      DD DSN=KC03FD9.INFT2200.A1.PLIST.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=60
/*