//RFD9A3      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL ??? FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//A3R        EXEC PGM=A3SCOMM
//STEPLIB      DD DSN=KC03FD9.INFT2200.COBOL.LOADLIB,
//    DISP=SHR
//INFILE       DD DSN=KC03FD9.INFT2200.A3.SCOMM.DAT,
//    DISP=SHR
//OUTFILE      DD DSN=KC03FD9.INFT2200.A3.SCOMM.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=101
/*